// src/components/AccordionUsage.js
import * as React from 'react';
import Accordion from '@mui/material/Accordion';
import AccordionActions from '@mui/material/AccordionActions';
import AccordionSummary from '@mui/material/AccordionSummary';
import AccordionDetails from '@mui/material/AccordionDetails';
import ExpandMoreIcon from '@mui/icons-material/ExpandMore';
import Button from '@mui/material/Button';
import './AccordionUsage.css'; // Import the CSS file
import CustomAccordion from './accordion';

export default function AccordionUsage() {
  const [expanded, setExpanded] = React.useState(false);

  const handleChange = (panel) => (event, isExpanded) => {
    setExpanded(isExpanded ? panel : false);
  };

  return (
    <div className='Big-container'>
    <div className='Accordion-contianer'>
       <CustomAccordion 
        expanded={expanded} 
        handleChange={handleChange} 
        panelId="panel1" 
        title="Сэтгэц - Бэлгийн хөгжил (Психосектуаль)" 
        content={"Хүүхдийн сэтгэцийн хөгжлийг чухалчилан үзсэн олон онол үзэл баримтлал байдгаас сэтгэц-бэлгийн (психосексуал) хөгжлийг тайлбарласан онол нь хамгийн ихээр хүний анхаарал татсан, тухайн үедээ шуугиан тарьсан онол байв. Учир нь Австрийн нэрт сэтгэл судлаач, эмч З.Фрейдийн боловсруулсан уг онол нь хүүхэд төрсөн цагаас хөгжих процесс нь бэлгийн үйл ажиллагаатай холбоотой хэмээн тайлбарласнаар хүмүүсийн эсэргүүцэлтэй учирч эхэлжээ. Тухайн үедээ ихээхэн шуугиан тарьж, олны эсэргүүцэлтэй тулгарч байсан ч уг онолын үзэл баримтлал одоог хүртэл яригдсаар ирсэн бөгөөд хүүхдийн хөгжлийн үеүдэд уг онцлог илэрсээр байгаа нь гайхалтай. ##Зигмунд Фрейдийн боловсруулсан психоанализын хувьд психосексуал хөгжлийг тухайн хүний биологийн үйл ажиллагааны өөрчлөлттэй холбон тайлбарладаг. ##Психосексуал хөгжил нь бэлгийн шинж чанар, бэлгийн үүрэг, сэтгэлзүйн чиг баримжаа үүсэх үйл явц.##Сэтгэц-бэлгийн хөгжлийн илрэлийг үечлэн гаргаад хөгжлийн үе бүртээ өөр өөр мэдрэмж хөгждөг хэмээн З.Фрейд тайлбарлажээ.##Хүний хөгжлийн үе шат бүрийн туршлага нь тухайн үе шатанд олж авсан хандлага, хувийн шинж чанар, үнэт зүйлсийн ул мөрийг үлдээдэг.##Үе шатууд - хөгжлийн зам дээрх үе шатууд, түүний үр дүн нь зан төлөвийг бий болгох урьдчилсан нөхцөл юм. Хүнд цочролын үед тэд мэдрэлийн эмгэг үүсгэдэг. Үе шатуудын нэрс нь бэлгийн дур хүслийн энерги төвлөрч, тухайн насны таашаал авах мэдрэмжтэй холбоотой биеийн үндсэн (эроген) бүсийг тодорхойлдог. ##Хүүхдийн хөгжлийн сэтгэц-бэлгийн үе шат:"} 
        content_list={"Амны хөндийн үе шат /Ораль/ (Хүүхэд төрснөөс хойш 1.5 нас хүртэл):  хүүхдийн бэлгийн амьдралын эхний үе шат. Судлаачид энэ үеийг “Хөхөх үе” гэж нэрлэсэн байдаг. Хүүхдийн ам нь хөхөх, хазах, залгих үйл явцаар илэрхийлэгддэг үндсэн органик хэрэгцээг хангах үндсэн эх үүсвэр болдог. Энэ нь амны хөндийн бэлгийн дур хүслийн энергийн катекц (концентраци)-аар тодорхойлогддог. Амьдралын эхэн үед төрсний дараа бэлгийн дур сонирхол нь өөрийгөө хамгаалах зөн совинтой салшгүй холбоотой боловч насны сүүлчийн мэдрэмжээс ялгаатай нь энэ нь дарангуйлах, олон талаар хувиргах чадвартай байдаг. Ам бол хүүхдийн хянах боломжтой биеийн хамгийн эхний хэсэг юм. Амны хөндийн бүрэлдэхүүн хэсгийн эхний объект бол нялх хүүхдийн хоол хүнсний хэрэгцээг хангаж өгдөг эхийн хөх юм. Хүүхэд эхийн хөхийг хөхөх, сорохдоо цадах сэтгэл ханамж, таашаал авдаг нь хожмын эротик мэдрэмжийн суурь тавигдаж байдаг хэмээн үзсэн. Дараагийн хөгжил нь аутоеротик үзлээс татгалзах, тусдаа хөтөч объектуудыг нэгтгэх гэсэн хоёр зорилготой байна (Фрейд, З., 2009). Хооллох үед хүүхдийг энхрийлэх, тэврээд найгах, ятгах зэргээр тайвшруулдаг. Эдгээр зан үйл нь стрессийг тайлахад тусалдаг бөгөөд нялх хүүхдийг хооллох (таашаал авах)-тай холбоотой байж болох юм. Энэ үе  шатанд хүрээлэн буй орчны талаарх хандлага бий болдог. Үүнд: итгэлцэл - үл итгэх байдал, хараат байдал - хараат бус байдал, дэмжлэг үзүүлэх мэдрэмж эсвэл гадны тусламжийн дутагдал. Хайрлах чадварууд бүрэлддэг. Эхний 6 сард хэт их эсвэл хангалтгүй өдөөлт нь хүний цаашдын идэвхгүй байдалд хүргэж, улмаар арчаагүй байдал, хэт эмзэг байдал, муудах байдал, байнгын зөвшөөрлийг эрэлхийлэхтэй холбоотой дасан зохицох шинж тэмдгээр илэрдэг. Энэ үеийн хоёрдугаар хагаст хазах, зажлах үйлдэл хийх чадварт шилждэг. Фрейдийн хэлснээр, энэ үед амны хөндий нь хүний амьдралын туршид эрогенийн чухал бүс хэвээр байгаа бөгөөд амны хөндийн холбогдолтой зан авираар илэрхийлэгддэг. ##Шулуун гэдэсний үе шат /аналь/ (1.5 - 3.5 нас) - хүүхдийн бэлгийн хөгжлийн хоёр дахь үе шат. Зарим бүтээл дээр энэ үеийг “Бие засч сурах үе” хэмээн орчуулсан байдаг нь нилээн зөв нэршил байж болох юм. Энэ үед хүүхэд бие засах үйлдлээ хянах, хоосон зугаа цэнгэл, үйл явцыг сонирхох мэдрэмжийг мэдэрч сурдаг. Энэ хугацаанд хүүхэд цэвэр ариун байдал, бие засах газраа сурч, бие засах хүсэл эрмэлзлийг хязгаарлаж сурдаг. Эго нь ид-ийнхээ хэрэгцээг ухамсарлах хэрэгсэл болдог. өөрөөр хэлбэл, дотоод хүсэл тэмүүллээ гадны орчин, нөхцөл байдлаар хязгаарлаж сурах үе. Жишээ нь, бие засахыг хичнээн хүсч байсан ч дуртай газраа, хамаагүй бие засахаа больж, хөтөвчинд суусан үедээ бие засч сурна. Ариун цэврийн газар, хөтөвчийг хэрэглэж бие зассанаар  эцэг эхийн үзүүлэх хариу үйлдэл нь хүүхдийн өөрийгөө хянах, өөрийгөө зохицуулах, өөртөө итгэлтэй болох зан үйлийг тодорхойлдог. Эцэг эхийн шаардлага хангалтгүй буюу хэт өндөр тохиолдолд “Биеэ хэт барих” (өтгөн хатах) эсвэл “түлхэх” буюу “хэт сул тавих” нь (хоол боловсруулах чадвар муу, суулгалт) гэсэн эсэргүүцлийн урвал үүсдэг. Эдгээр хариу үйлдлүүд дараа нь зан чанарын хэлбэрт шилждэг. Өөрөөр хэлбэл, “биеэ хэт барих” нь зөрүүд, харамч, шунахай, төгс төгөлдөрт тэмүүлэх зэрэг, “түлхэх” нь тайван бус, хувьсамтгай, өөрчлөлтөнд тайван шинжийг гаргадаг байна. ## Фаллын үе шат (3.5 - 6 настай) - хүүхдийн бэлгийн харьцааны гурав дахь үе шат. Хүйсийн ялгааг мэдрэх үе ч гэж нэрлэдэг. Энэ үед хүүхэд бие махбодоо судалж, бэлэг эрхтнээ шалгаж, хүрч үздэг. Хүйсийн харилцаа, хүүхдүүдийн гадаад төрх байдалд сонирхолтой болдог. Эсрэг хүйсний эцэг эх, ижил хүйстний эцэг эхтэй ижилсэх, тодорхой жендэрийн үүрэг ролийг бий болгох сонирхол байдаг. Супер-Эго нь зан авирын хүлээн авсан хэм хэмжээг дагаж мөрдөх, зөв зан үйлийн дүр төрхийг дагаж мөрдөх үүрэгтэй хувийн шинж чанарыг хянах хэсэг болж бүрддэг. Бэлгийн эрхтнийг сонирхох байдал үүсч, эсрэг хүйстний бэлэг эрхтнийг харахыш хүсэх, энэ насанд бэлэг эрхтнээ оролдох үйлдэл сонирхолтой санагддаг. Энэ үеийн гол бэлгэ тэмдэг бол эр бэлгийн эрхтэн, фаллус бөгөөд гол үүрэг бол бэлгийн  хөгжилд өөрийгөө тодорхойлох явдал юм. Эрэгтэй хүүхдүүдэд “Эдипийн комплекс” үүснэ. Энэ нь ээжийгээ хайрлах, бусдаас харамлах, эзэмших хүсэл юм. Хүсэл тэмүүлэхэд саад болдог зүйл бол илүү хүчтэй эр хүн буюу түүний аав юм. Иймээс аавтайгаа ухамсаргүй өрсөлдөөнд орж, хөвгүүд тулаанд ялагдсаны мэт мэдрэмжтэй болж, “засуулсан” мэт айдастай болдог байна. Ойролцоогоор 5-6 настайдаа ээжийгээ хайрлах, эцгийгээ үзэн ядах хоёрдмол мэдрэмж даван туулдаг байна. Үүний зэрэгцээ өөрийгөө аавтайгаа адитган, аялгуу, үг хэллэгийг дууриах, дадал зуршил, зан байдал, зан үйлийн хэв маягийг өөртөө хэвшүүлэх, давтах байдал ажиглагдана. Фаллын шинж чанартай хүмүүс (фаллын бэхэлгээ) нь ихэвчлэн өөрсдийгөө бодит байдал дээр 'тодотгодог', тод, хурц  зан авиртай байдаг. Энэхүү онцлог шинж чанар нь зан авирын ижил төстэй байдлаас болж сэтгэл зүйн психопатитай хиллэдэг. Энэ насны охидод бол “Электрийн комплекс” ажиглагдана. Энэ нь охин эцэгтээ хайртай гэдгээ харуулж, эцэгтэйгээ гэрлэнэ хэмээн ярьж, ээжтэйгэээ аавыгаа булаацалдах хандлага бий болно. Хөвгүүдээс ялгаатай нь охид энэ үед ээжийгээ үзэн ядахгүй бөгөөд ээж шигээ гоё болно, аавтайгаа гэрлэнэ гэсэн бодлууд үүссэн байдаг. ##Далд үе (6 - 12 нас) - бэлгийн сонирхлын бууралтаар тодорхойлогддог хүүхдийн бэлгийн амьдралын дөрөв дэх үе шат. Сэтгэцийн “Би” хандлага нь “Тэр”-ийн хэрэгцээг бүрэн хянадаг. Бэлгийн дур хүслээс салах үед бэлгийн дур хүслийн эрч хүчийг бэлгийн бус зорилгод шилжүүлдэг. Тухайлбал, сурах, соёлын туршлага хуримтлуулах, гэр бүлийн орчноос гадуур үе тэнгийнхэн болон насанд хүрэгчидтэй нөхөрлөх зэрэг.##Бэлэг эрхтний хөгжлийн үе шат (12-16 нас) - тав дахь үе шат. Фрейдийн сэтгэл зүйн бэлгийн үзэл баримтлалын эцсийн шат. Энэ нь бэлгийн бойжилтын үеийн биологийн төлөвшилт, сэтгэцийн бэлгийн хөгжлийн явцаас үүсдэг. Бэлгийн хүч чадал, түрэмгий хүсэл эрмэлзэл ихэсдэг. Энэ үе шатанд бэлгийн нас бие гүйцсэн хүмүүсийнхтэй ижил бэлгийн харилцаа үүсэх боломж бүрддэг. Нийгэмд байр сууриа олох, бэлгийн хамтрагчаа сонгох нь чухал болж эхэлнэ. Эцэг эхийн эрх мэдлийн хяналтаас салж, тэдэнд ээнэгшин дасахаас ангижирна"} 
      />
       <CustomAccordion 
        expanded={expanded} 
        handleChange={handleChange} 
        panelId="panel2" 
        title="Оюун ухааны хөгжлийн онолууд (Интеллект)" 
        content={"Хүүхдийн оюун ухааны хөгжлийг судлан тодорхойлох олон янзын оролдлого хийсэн байдаг. Үүнд: Ж.Пиажегийн “Оюун ухаан шатлан төлөвших онол”, Гарднерийн ... онол зэргийг дурдаж болно.  ##Ж.Пиажегийн үзэл хандлага. ##Оюун ухаан хөгжлийн онолын томоохон төлөөлөгч Ж.Пиажегийн анх гаргасан онолын хандлага нь өмнө эрдэмтэн, судлаачдын энэ чиглэлээр хийж байсан ажлаас эрс өөр байв. Тэрээр: ## Бүх суралцагчдыг судлахын оронд хүүхдүүдэд анхаарлаа төвлөрүүлэв.##Онол нь тодорхой зан байдал, мэдлэгийг сурч боловсрох биш харин бүхэлдээ хөгжлийн тухай байв.##Сэтгэцийн хөгжил нь аажмаар явагдах үйл явц бөгөөд энэ үед хүний зан байдал улам бүр нарийн төвөгтэй болдог гэсэн нийтээр хүлээн зөвшөөрсөн үзэл бодлын эсрэг Ж.Пиаже хэд хэдэн тусдаа үе шатыг ялгаж, тэдгээрийг тодорхой тоон шинж чанаруудаар тодорхойлсон байдаг. ##Ж.Пиаже хүүхдүүд сэтгэхдээ насанд хүрэгчдээс дутуу биш харин тэд удамшлын болон хувьслын шинж тэмдгүүдийн иж бүрдэл болох сэтгэцийн суурь бүтэцтэй төрсөн бөгөөд тэдний сурах, мэдэх нь энэхүү бүтцээс үүдэлтэй гэж үзсэн. Энэхүү үндэс суурийг үндэслэн тэрээр нярай болон түүнээс дээш насны хүүхдүүдийн сэтгэцийн үйл явц, механизмыг тайлбарлахыг оролдсон бөгөөд энэ нь цаг хугацаа өнгөрөхөд логик сэтгэлгээнд сурч, таамаглал дэвшүүлэн ажиллах боломжийг олгодог гэсэн. Ж.Пиажегийн хэлснээр, хүүхдүүдийн хүрээлэн буй орчны талаарх ойлголт аажмаар хөгжиж, тэд урьд өмнө мэддэг байсан болон сурч мэдсэн зүйлийнхээ зөрүүтэй тулгарах нь гарцаагүй юм. Ж.Пиажегийн оюуны хөгжлийн онолыг гурван өөр бүрэлдэхүүн хэсэгт хувааж үзэж болно (Paul Kleinman, 2012). Үүнд:"} 
        content_list={"Үйл ажиллагааны схемүүд нь обьектуудыг ижил төстэй, ялгаатай байдлаар нэгтгэдэг мэдлэгийн үндсэн суурь юм. Диаграмм бүр нь хүрээлэн буй ертөнцийн талаарх нэг мэдлэгийг (жишээ нь, үйл ажиллагаа, объект эсвэл үзэл баримтлал гэх мэт) хамааруулдаг бөгөөд тодорхой нөхцөл байдлыг ойлгож, түүнд хариу үйлдэл үзүүлэхэд ашигладаг харилцан уялдаатай цуврал дүрслэлийг илэрхийлдэг. Жишээлбэл, хүүхдэд нохой дүрсэлсэн зургийг үзүүлбэл тэр өөрөө дөрвөн хөл, сүүл, чих гэх мэтээр амьтны дүр төрхийг бүтээдэг. Хэрэв хүүхэд өөрт байгаа схемээ ашиглан юу мэдэрч, юу бодож байгаагаа тайлбарлаж чадвал тэр сэтгэл зүйн тэнцвэртэй байдалд байна. Үйл ажиллагааны хэв маягийг хүүхдийн ой тогтоолтонд хадгалдаг бөгөөд хэрэв шаардлагатай бол ирээдүйд тэр үүнийг ашигладаг. Жишээлбэл, ресторанд анх удаа зочлохдоо хүүхэд хоол захиалахтай холбоотой шинэ үйл ажиллагааны төлөвлөгөө гаргадаг. Дараагийн удаа тэр ийм газар ирэхдээ одоо байгаа мэдлэгээ шинэ боловч ижил төстэй нөхцөлд ашиглах боломжтой болно.        \n Ж.Пиаже мөн үйл ажиллагааны зарим хэв маяг нь хүүхдүүдэд генетикийн хувьд програмчлагдсан байдаг, жишээлбэл, бага насны хүүхэд гарт тааралдсан бүх зүйлийг амандаа хийх, хөхөх хандлагатай байдаг гэж үзсэн. ##Нэг үе шатаас нөгөө шатанд шилжих явдлыг хангах үйл явц. Ж.Пиаже оюуны хөгжил нь мэдлэгийн дасан зохицол, хүний тэнцвэрт байдлын хүслийн үр дүн гэж үздэг. Мэдлэгт дасан зохицох үйлийг хоёр аргаар явуулдаг. Үүнд:\n Ассимиляци - гэдэг нь аль хэдийн бий болсон үйл ажиллагааны схемийг ашиглах, шинэ нөхцөл байдалд хэрэглэх явдал юм. \n Аккомодаци - нь шинэ мэдээлэл олж авах зорилгоор одоо байгаа үйл ажиллагааны схемийг өөрчлөх явдал юм. \nАссимиляци ба аккомодациг хэрхэн хэрэгждэгийг илүү сайн ойлгохын тулд дээрх нохойн жишээг эргэж үзье. Одоо хүүхэд амьтны дүр төрхийг харуулсан схемтэй байна. Үүнд, дөрвөн хөл, сүүл, чих зэрэг. Гэхдээ жинхэнэ нохой түүнд гудамжинд ойртох үед түүний схемд ороогүй бусад шинж чанаруудыг олж харах болно. Нохой үсээр хучигдсан байдаг, тэр гараа долоодог, хуцдаг. Эдгээр бүх шинж тэмдгүүд нь эхний схемд байхгүй тул тэнцвэргүй байдал үүсч, хүүхэд өөрийн шинэ санааг бий болгож эхэлдэг. Хэрэв эцэг эх нь шинэ мэдээлэл нохойд хамаатай болохыг батлавал, хүүхэд шинэ мэдээллийг одоо байгаа схемд амжилттай оруулснаар ассимиляци үүсч тэнцвэртэй болно.\nГэхдээ хүүхэд гудамжинд нохой биш муур харвал яах вэ? Хэдийгээр тэдгээр нь өөр өөр амьтад боловч зарим шинж чанарууд ижил байдаг. Муур нь мяу гэж дуугардаг, тэр модонд авирч чаддаг, хөдөлж, нохойноос эрс өөр зан авир гаргадаг. Муурыг хараад хүүхэд тэнцвэргүй байдлаас гарч, шинэ мэдээллийг зохицуулах (байрлуулах) шаардлагатай тул тэнцвэртэй байдалдаа эргэн орж, шинэ схемийг бий болгодог. ## Оюун ухааны хөгжлийн үе шатууд. Ж.Пиаже хүүхдийн сэтгэцийн хөгжил дөрвөн үе шат дамждаг гэж үздэг. Энэ бол дэлхийн хаана ч хамаагүй, ямар соёл иргэншилтэй байгаагаас үл хамааран бүх хүүхдэд илрэх онцлог шинж юм. Гэсэн хэдий ч бүх хүүхдүүд сүүлийн шатаар явдаггүй (Paul Kleinman, 2012). \n Ж.Пиажегийн үзэж байгаагаар оюун ухааны хөгжлийг дөрвөн гол үе шатыг тодорхойлох боломжтой."}
      />
      

      <Accordion  sx={{ borderRadius: '12px' }}
        className={`accordion ${expanded === 'panel3' ? 'expanded' : ''}`} 
        expanded={expanded === 'panel3'} 
        onChange={handleChange('panel3')}
      >
        <AccordionSummary sx={{ borderRadius: '12px' }}
          expandIcon={<ExpandMoreIcon />}
          aria-controls="panel3-content"
          id="panel3-header"
          className="accordion-summary"
        >
          Ёс суртахууны хөгжлийн үе шатууд (Этический)
        </AccordionSummary>
        <AccordionDetails sx={{ borderRadius: '12px' }} className="accordion-details"> 
          <p className='details-p'>
          Хөгжийн сэтгэл судлалд нэгээхэн чухал байр суурь эзэлдэг онол бол Л.Кольбергийн “Ёс суртахууны хөгжлийн онол” (мөн ёс суртахууны хөгжлийн үе шатууд гэж ч нэрлэдэг). Уг онол нь анх Швейцарийн сэтгэл судлаач Жан Пиажегийн гаргасан сэтгэл зүйн онолын үндэс дээр боловсруулагдсан. 
          </p>
          <p className='details-p'>
          Судлаач Л.Кольберг 1958 онд Чикагогийн Их Сургуульд сэтгэл судлалын чиглэлээр төгссөн оюутан байхдаа энэ сэдвээр ажиллаж эхэлсэн бөгөөд амьдралынхаа туршид энэхүү онолыг боловсруулж ирсэн юм. Энэхүү онолын дагуу ёс суртахууны зан үйлийн үндэс суурийг бүрдүүлдэг ёс суртахууны сэтгэхүй нь хөгжлийн зургаан үе шатыг дамжин хөгждөг байна. Эдгээр үеэс үе бүрт ёс суртахууны нөхцөл байдал илүү хүнд, бэрхшээлтэй болдог ажээ. 
          </p>
          <p className='details-p'>
          Л.Кольберг ёс суртахууны хөгжлийг өмнө нь Ж.Пиаже судалж байсан. Тэр үеийн хил хязгаараас хол давсан бөгөөд логик ба ёс суртахуун нь бүтээлч үе шатууд дээр үндэслэн хөгждөг гэж үздэг. Пиажегийн бүтээлийг боловсруулж, Л.Кольберг шударга ёсны үзэл баримтлал нь ёс суртахууны хөгжлийн явцад гол үүрэг гүйцэтгэдэг бөгөөд энэ хөгжил нь хүний амьдралын туршид явагддаг болохыг тогтоожээ. Энэхүү үзэл баримтлалыг ашигласнаар ийм судалгааны философийн үр дагаврын талаар харилцан яриа бий болсон. 
          </p>
          <p className='details-p'>
          Л.Кольбергийн ёс суртахууны хөгжлийн загвар нь дараах хүчин зүйлийг чухалчилсан байна. Үүнд: Өөр өөр нийгэм, соёлын төлөөлөгчид үндсэн үнэт зүйлийг хүлээн зөвшөөрөх тал дээр өөр хоорондоо ялгаатай байдаггүй. Л.Кольберг хууль, хэм хэмжээ, мөс чанар, өөрийн мэдрэмж, эрх мэдэл, иргэний эрх, гэрээ, итгэлцэл, шударга байдлыг илэрхийлэх чадвар, солилцоо, шийтгэлийн шударга байдал, амь нас, эд хөрөнгийн эрх, үнэн, хайр, бэлгийн харьцааг илэрхийлэх чадвар гэсэн арван нэгэн утгыг тодорхойлсон. Тиймээс ёс суртахууны хөгжлийн үе шатыг зан чанараар бус харин эдгээр үнэт зүйлд хандах хандлагын хэв маягаар тодорхойлдог.
          </p>
          <p className='details-p'>
          Загварын гол ойлголт бол шударга ёсны тухай ойлголт юм. Шударга ёсны зарчмууд нь оролцогчдын ашиг сонирхлын зөрчлөөс үүссэн ёс суртахууны зөрчлийг шийдвэрлэх үндэс суурь болно. Шударга ёсны мөн чанар нь тэгш байдал, харилцан ойлголцлын үзэл баримтлалаар зохицуулагддаг эрх үүргийн хуваарилалт юм.
          </p>
          <p className='details-p'>
          Ёс суртахууны төлөвшил, ёс суртахууны хөгжлийн хамгийн дээд түвшинд хүрэх шалгуур бол хоёулаа бүх нийтийн ёс суртахууны зарчмуудыг хүлээн зөвшөөрч, хүн ёс суртахууны шинэ үнэт зүйлийг өөрийн ёс суртахууны үзэл баримтлалаар хөгжүүлэх явдал юм.
          </p>
          <p className='details-p'>
          Үүссэн хэлбэрийн хувьд ёс суртахууны "үйл ажиллагааны" систем нь логик, математик, физик (эсвэл үйл ажиллагаа)-т угаасаа эргэх, тэнцвэржүүлэх шинж чанаруудтай байдаг. Ёс суртахууны "үйл ажиллагаа"-г буцааж өгөх чадвар нь тухайн хүний ёс суртахууны зөрчилдөөний бусад оролцогчдын байр суурийг авч үзэх чадварыг хөгжүүлсний үр дүнд бий болдог.
          </p>
          <p className='details-p'>
          Хувь хүний ёс суртахууны үндсэн хэм хэмжээ, зарчмууд нь “гадны” хэм хэмжээг автоматаар шингээж авдаггүй бөгөөд шагнал, шийтгэлийн туршлагын үр дүнд бий болдоггүй, харин нийгмийн харилцааны явцад боловсронгуй болдог.
          </p>
          <p className='details-p'>
          Бүх соёл нийгмийн харилцан үйлчлэлийн нийтлэг үндэс суурьтай тул бүх нийгэм дэх ёс суртахууны хөгжлийн үйл явц нь ерөнхий хуулиудад захирагддаг
          </p>
          <p className='details-p'>
          Л.Кольбергийн зургаан үе шатыг гурван түвшинд хувааж болох бөгөөд тус бүрдээ уламжлалт, уламжлалын дараах гэсэн хоёр үе шаттай. 
          </p>
          <p className='details-p'>
          Л.Кольберг Пиажегийн танин мэдэхүйн үе шатуудтай адил хатуу дарааллаар явагддаг ёс суртахууны хөгжлийн 6 үе шатыг тодорхойлсон. Ёс суртахууны нэг үе шатаас нөгөөд шилжих нь танин мэдэхүйн чадвар, өрөвдөх чадварыг хоёуланг нь хөгжүүлэх үр дүн юм. Л.Кольберг үе шатаа тодорхой насны хүрээтэй холбодоггүй. Ихэнх хүмүүс ёс суртахууны хөгжлийнхөө дор хаяж гурав дахь шатанд хүрдэг байхад бусад нь амьдралынхаа туршид ёс суртахууны хувьд төлөвшөөгүй хэвээр байна. Үе шатуудыг алгасах боломжгүй бөгөөд тус бүр нь тэдэнтэй нэгдэхийн хамт өмнөх хувилбаруудаасаа илүү шинэ, илүү төвөгтэй, ялгавартай байдалд хүргэх нь гарцаагүй юм. 
          </p>
  <h3>Түвшин 1. Уламжлалтаас өмнөх</h3>
    <ul>
      <li>Шийтгэл ба дуулгавартай байдалд чиглүүлэх (Би хэрхэн шийтгэлээс зайлсхийх вэ?)</li>
      <li>Гэнэн гедонист чиг баримжаа (Энд надад ямар хэрэгтэй юм бэ?)</li>
    </ul>
    <h3>Түвшин 2. Уламжлалт</h3>
    <ul>
      <li>Ойролцоох орчин /жижиг бүлэгт нийцүүлэх чиглэл (нийгмийн хэм хэмжээ, “сайн хүүхэд”-ийн загвар)</li>
      <li>Нийгмийн шударга ёсны тогтсон дэг журам, тогтсон дүрмийг сахин хамгаалах (Ёс суртахуун нь дүрэм, хуультай нийцдэг)</li>
    </ul>
    <h3>Түвшин 3. Уламжлалт дараа</h3>
    <ul>
      <li>Утилитаризм ба нийгмийн гэрээний (нийгмийн гэрээ) бүтээгдэхүүн болох ёс суртахууны тухай ойлголт</li>
      <li>Бүх нийтийн ёс зүйн зарчим (өөрийн ёс суртахууны зарчим ба ухамсар нь зохицуулагчийн хувьд)</li>
    </ul>
    
    <p className='details-p'>Үе шат бүрт олж авсан ойлголтыг дараагийн үе шатанд хадгалж үлдэх боловч нарийвчлан авч үзэхэд хэт хялбаршуулсан гэж үзэж болно.</p>
    <h3>Уламжлалт өмнөх түвшин:</h3>
    
          <p className='details-p'>Ёс суртахууны өмнөх уламжлалт сэтгэхүйн түвшин нь ялангуяа хүүхдүүдэд түгээмэл тохиолддог боловч насанд хүрэгчид үүнтэй ижил төстэй үндэслэлтэй байж болно. Энэ түвшний хувь хүн аливаа үйлдлийн ёс суртахууныг шууд үр дагавраар нь дүгнэдэг. Уламжлалт түвшин нь ёс суртахууны хөгжлийн эхний ба хоёрдугаар үе шатуудаас бүрдэх бөгөөд зөвхөн хувь хүний эгоцентрист хандлагатай холбоотой байдаг. Уламжлалтаас өмнөх түвшинд байсан хүүхэд зөв, буруу зүйлийн талаар нийтээр хүлээн зөвшөөрсөн хэм хэмжээг хараахан эзэмшиж, дотооддоо эзэмшиж амжаагүй байна. Үүний оронд аливаа үйлдэлд гарч болзошгүй гадаад үр дагаварт голчлон анхаарлаа төвлөрүүлдэг.</p>
    <h4>1-р үе шат:</h4>
    
          <p className='details-p'>Хүүхэд шийтгэлээс зайлсхийх цорын ганц арга зам гэж үздэг тул дуулгавартай байхыг хичээдэг. Түүний хувьд үйл ажиллагааны ёс суртахууны аль ч тал одоогоор байхгүй байна. “Ичсэн”, “муухай” гэсэн үгсийг ойлгоход хамааралгүй, хүүхэд “үгүй”, “өвдөж байна” гэсэн үг, шийтгэл хүлээх хандлагад хариу үйлдэл үзүүлдэг. Жишээлбэл, үйлдсэн этгээдийг шийтгэх үед тухайн үйлдлийг ёс суртахууны хувьд буруу гэж ойлгодог. “Хамгийн сүүлд би үүнийг хийчихээд цохисон болохоор дахиж ийм зүйл хийхгүй”. Үйлдлийн шийтгэл нь хэдий чинээ муу байна, төдий чинээ “муу” гэж ойлгогдоно. Энэ нь гэм зэмгүй хохирогчид хүртэл тэдний зовлонгийн хувь хэмжээгээр буруутай гэсэн дүгнэлтэд хүргэж магадгүй юм. Бусад хүмүүсийн үзэл бодол нь тухайн хүний үзэл бодлоос өөр байж болно гэсэн ойлголт байхгүй үед энэ нь "эгоцентрик" байр суурь юм.</p>
    <h4>2-р үе шат:</h4>
    
          <p className='details-p'>Хүүхдийн үйлдэл нь шагналд чиглэсэн байдаг. Тэрээр ашиг тусын тулд зөв зүйтэй зүйлсийг хийдэг. Хүүхэд зан төлөвийн янз бүрийн стратегиудыг туршиж үзээд амжилтанд хүрсэн гэж үздэг. Жишээлбэл, тэр дуртай зүйлээ аваад зогсохгүй солилцож чаддаг. Хүүхэд тухайн нөхцөл байдлаас шалтгаалан янз бүрийн стратегитай байдаг. Үйлдлийн ёс суртахууны тал одоо хүртэл байхгүй байна. Шалтгааны хоёр дахь үе шат нь бусдын хэрэгцээнд хязгаарлагдмал сонирхлыг харуулдаг, гэхдээ зөвхөн тухайн хүний өөрийн ашиг сонирхолтой огтлолцох цэг хүртэл. Үүний үр дүнд бусдыг халамжлах нь үнэнч байдал эсвэл харилцан хүндэтгэл дээр суурилдаггүй бөгөөд харин “Нуруугаа мааж, тэгвэл би чиний нурууг маажина” гэсэн зарчим дээр суурилдаг. Энэ үе шат нь бүх үйл ажиллагаа нь өөрсдийн хэрэгцээ эсвэл хувь хүний ашиг сонирхлыг хангахад чиглэгддэг тул энэ үе шат нь нийгмийн гэрээнээс (тавдугаар үе шат) тэс өөр юм.</p>
    <h3>Уламжлалт түвшин:</h3>
    
          <p className='details-p'>Ёс суртахууны үндэслэлтэй байдлын ердийн түвшин нь өсвөр насныхан, насанд хүрэгчдэд байдаг. Энэ түвшний хувь хүн үйл ажиллагааны ёс суртахууныг нийгмийн үзэл бодол, хүлээлттэй харьцуулж шүүнэ. Уламжлалт түвшин нь ёс суртахууны хөгжлийн гурав, дөрөв дэх үе шатуудаас бүрдэнэ. Уламжлалт ёс суртахуун нь зөв, буруу зүйлийн талаарх нийгмийн конвенцийг хүлээн зөвшөөрөх замаар тодорхойлогддог. Энэ түвшинд хувь хүн дүрмийг дагаж мөрддөг.</p>
    <div className="details-p-list">
      <ul>
        <li>Үнэт зүйлс (С.Шварц, Р.Инглехарт, В.Билски).</li>
        <li>Хүч чадал, ариун журам (М. Селигман, К. Петерсон).</li>
        <li>Мэргэн ухаан нь ёс суртахуун ба оюун санааны синтез (П.Балтес).</li>
        <li>Шударга байдлын сэтгэл зүй.</li>
        <li>Хууран мэхлэлт ба худал хуурмаг байдал; худал хуурмагийн төрлүүд (прагматик ба "авралын төлөө худал", өнгөрсөн ба өнөө үед чиглэсэн) (В.В. Знаков).</li>
        <li>Шударга байдал /хууран мэхлэлтийн хувийн болон хувийн хүчин зүйлс. Шударга ёсны сэтгэл зүй. Үндсэн ойлголтууд. Шударга ертөнцөд итгэх итгэл (М. Лернер, К. Далберт) - дасан зохицох функцууд. Хувийн болон хамтын шударга ёсонд итгэх. Нийгэмд хандах хандлага, зан төлөвтэй холбоо тогтоох. Шударга ёсны мэдрэмж (М. Шмитт). Хохирогч, гэмт хэрэгтэн, гэрч, ашиг хүртэгч гэсэн дөрвөн албан тушаал. Байнгын ба эцсийн шударга ёс (J. Maes). Шударга байдалтай холбоотой шинж чанаруудын сэтгэлзүйн сайн сайхан байдалд үзүүлэх нөлөө. Нийгмийн хүрээнд шударга байдал. Байгаль орчны шударга ёс. Өршөөлийн сэтгэл зүй. Уучлах чадвар ба сэтгэлзүйн сайн сайхан байдал (Л. Томпсон). Өршөөл үзүүлэхийг хориглох. Шийдвэр гаргах, туршлага, биеэ авч явах байдал, бэрхшээлийг даван туулах гэх мэт уучлал. Уучлал нь шударга бус байдлыг шийдвэрлэх энергийн хэмнэлттэй стратеги юм. Уучлахаас эмээх: Өршөөлийн талаар өрөөсгөл ойлголт. Талархлын сэтгэл зүй (M. McCullough, R. Emmons). Үүнтэй холбоотой ойлголтуудын тезаурус: талархал, өршөөл, талархал (N. Fagley, F. Watkins). Талархлын парадоксууд: онцгой нөхцөл байдлын илрэл. Талархал ба сэтгэлзүйн сайн сайхан байдал.</li>
      </ul>
    </div>
    <h3>Онтогенез дэх ёс суртахууны хөгжил. Ёс суртахууны сэтгэлзүйн хэрэглээний асуултууд:</h3>
    <ul>
      <li>Аман ба бодит зан байдал.</li>
      <li>Ёс суртахууны зөрчил. "Гашуун чихэр" -ийн үзэгдэл (А.Н.Леонтьев). Үйлдэл, хувь хүний үнэлгээ.</li>
      <li>Урам зориг ба шийтгэл.</li>
      <li>Гэр бүлийн боловсрол ба түүний хүүхдийн ёс суртахууны хөгжилд гүйцэтгэх үүрэг.</li>
      <li>Ёс суртахууны дадал зуршил.</li>
      <li>Ёс суртахууны нөлөө (итгүүлэх). Талархах, уучлах чадварыг хөгжүүлэх.</li>
      <li>Шүүлт ба бусад ёс суртахууны илрэл дэх жендэрийн ялгаа.</li>
    </ul>
    <h3>Хэрэглээний асуултууд:</h3>
    <ul>
      <li>анагаах ухааны мэргэжлийн ёс зүй,</li>
      <li>сэтгэлзүйн эмчилгээ,</li>
      <li>хэт мэргэжлийн ажил мэргэжил.</li>
      <li>Байгаль орчны ёс зүй.</li>
      <li>Ёс зүй ба улс төр (ялгаварлан гадуурхах янз бүрийн хэлбэрүүд: арьс өнгөөр ялгаварлах үзэл, шовинизм, дээрэлхэх гэх мэт).</li>
      <li>Ёс суртахууны хазайлт.</li>
    </ul>



          <p className='details-p'>
          
          </p>
          <p className='details-p'>
          
          </p>
           </AccordionDetails>
      </Accordion>



      <Accordion  sx={{ borderRadius: '12px' }}
        className={`accordion ${expanded === 'panel4' ? 'expanded' : ''}`} 
        expanded={expanded === 'panel4'} 
        onChange={handleChange('panel4')}
      >
        <AccordionSummary sx={{ borderRadius: '12px' }}
          expandIcon={<ExpandMoreIcon />}
          aria-controls="panel4-content"
          id="panel4-header"
          className="accordion-summary"
        >
          Сэтгэц нийгмийн хөгжлийн үе шатууд (Психосоциаль)
        </AccordionSummary>
        <AccordionDetails sx={{ borderRadius: '12px' }} className="accordion-details">
          <p className='details-p'>
          Хөгжлийн сэтгэл судлалд насны үечлэлээр ялган ангилах оролдлого хийсэн олон онол хандлагууд байдаг. Тэдгээрийн дотор Э.Эриксоны хүний сэтгэцийн хөгжил нийгмийн хандлагыг нэгтгэн гаргасан ангилал онцгой байр суурь эзэлдэг. 
          </p>
          <p className='details-p'>
          1963 онд Эрик Эриксон хүний амьдралын мөчлөгийн үе шатуудад хувь хүний нийгэм сэтгэл зүйн шинж чанаруудын үүсэл, хөгжил хийгээд төлөвшилтөнд нийгмийн хүрээнд буй орчин, ялангуяа нийгмийн харилцаа, хүмүүжил ямар нөлөө үзүүлдэгийг тусгасан үзэл баримтлалыг боловсруулсан. Тэрбээр хүний амьдралын мөчлөгийг нийгэм сэтгэл зүйн хөгжлийг дараах 8 үе шатанд хуваан үзжээ. Үүнд:
          </p>
          <ul>
            <li>Нялх насны үе (0-18 сар),</li>
            <li>Балчир насны үе (18 сараас 3 нас),</li>
            <li>Тоглоомын насны үе (3-5 нас),</li>
            <li>Сургуулийн насны үе (6-12 нас),</li>
            <li>Өсвөр насны үе (12-18 нас),</li>
            <li>Ид насны үе (18-35 нас),</li>
            <li>Дундаж насны үе (35-65 нас),</li>
            <li>Ахмад насны үе (65-аас дээш).</li>
          </ul>
          <h4>
          1.	Нялх насны үе (0-18 сар) - Итгэх ба үл итгэх мэдрэмжийн хямралын үе.
          </h4>
          <p className='details-p'>
          Хүний амьдралын мөчлөгийн нийгэм сэтгэл зүйн энэ үе шатанд нялх хүүхдэд итгэх буюу үл итгэх мэдрэмж үүсч төлөвшинө. Итгэх, үл итгэх хэмээх хоёр мэдрэмжийн аль нь үүсч төлөвших нь эх нь нялх хүүхдэд хэрхэн хандаж, түүнийг яаж асарч байснаас шууд шалтгаална. 
          </p>
          <p className='details-p'>
          Итгэл найдвар – ээнэгшин дасахуй. Нялх үеийн туршид эхийнхээ энхрийллийг мэдэрч, хөхөө хөхөж, бүүвэйлэх дууг нь сонсож бойжсон нялх хүүхдэд итгэл найдварын мэдрэмж суурьшиж, төлөвшинө. Итгэлийг өөртөө шингээсэн нялх хүүхэд өөртөө болон бусад хүмүүст итгэж найддаг, дотоод сэтгэлийн тэнцвэртэй хүн болж төлөвшинө. Итгэл бол бие хүний бусад эерэг шинжүүд үүсч төлөвшихийн сэтгэл зүйн үндэс юм.
          </p>
          <p className='details-p'>
          Үл итгэх. Хэрэв нялх үеийн турш тухайн хүүхдэд энхрийллээр биш, харин түүнийг айлгасан, цочроосон хийгээд шийтгэсэн хандлагаар харилцаж байвал тэрбээр бусад хүмүүст итгэдэггүй, эргэлзэмтгий, хардамхай хүн болж төлөвших магадлал маш өндөр болдог. Нялх үед үүсч төлөвшсөн үл итгэх шинж нь бие хүний бусад сөрөг шинж чанарууд үүсэхийн сэтгэл зүйн үндэс болно.
          </p>
          <h4>2.	Балчир насны үе (18 сараас 3 нас) –Тусгаар байдал ба ичиж эргэлзэхийн зөрчлийн үе </h4>
          <p className='details-p'>
          Төрсний дараах эхний 3 жилд хүүхдийн байгалийн жам ёсны үйл хөдлөлийг нь нийгмийн зүгээс цагдан хориглож байгаа эсэхээс шалтгаалан балчир насны хүүхдэд эсвэл биеэ барих, ичиж зовох, эргэлзэн тээнэгэлзэх шинж чанар, эсвэл биеэ даасан байдал үүсч төлөвшинө.
          </p>
          <p className='details-p'>
          Ичиж зовох ба эргэлзэн тээнэгэлзэх шинж чанар. Бага насны хүүхдийн байгалийн жам ёсоор биеэ авч явахыг нь, тухайлбал, дуртай цагтаа хөхөө хөхөх, хооллох, бие засахыг нь, түүнчлэн чөлөөтэй хөдлөхийг нь хориглоод байвал түүнийг нийгэм сэтгэл зүйн хувьд “дутуу дулимаг” хүн болгон төлөвшүүлнэ. Ийм хүмүүжилтэй бага насны хүүхдэд бусдын үгэнд оромтгой, хүлцэнгүй, ичимтгий хийгээд эргэлзэн тээнэгэлзэх шинж чанар, эсвэл биеэ даасан байдал үүсч төлөвшинө.
          </p>
          <p className='details-p'>
          Бие даасан байдал. Балчир насны хүүхдийн байгалийн жам ёсны үйл хөдлөлийг нь жишээлбэл, хүссэн цагтаа хөхөө хөхөхийг, хооллохыг, бие засахыг нь, бас чөлөөтэй хөдлөхийг нь эцэг эх буюу бусад хүмүүсийн зүгээс цагдан хориглолгүй чөлөөтэй байлган хүмүүжүүлбэл түүнд биеэ даасан байдал үүсч төлөвшинө. Биологи, нийгэм, сэтгэл зүйн ямар нэг тулгамдсан асуудлаа хувь хүн бие даан шийдвэрлэх өөрийн эрхтэй байхыг, бас хүний мэдэлд ордоггүй байхыг биеэ даасан байдал гэдэг.
          </p>
          <h4>3.	Тоглоомын насны үе (3-5 нас) – Идэвх санаачлага ба захирагдсан байдал төлөвших үе.</h4>
         
         
          <p className='details-p'>
          Бага насны хүүхдэд эсвэл идэвх санаачилга, эсвэл захирагдсан байдал төлөвшинө. Бага насны хүүхдүүдийн нийгэм сэтгэл зүйн үндсэн хэрэгцээ нь тоглоом байдаг. Тэд тоглоомоор дамжуулж ертөнцийг танина.
          </p>
          <p className='details-p'>
          Идэвх санаачлага. Тоглоом тоглохдоо идэвхтэй, идэвхгүй хоёр байр суурийн алиныг баримталдаг байснаас шалтгаалан бага насны хүүхдэд эсвэл идэвх, санаачлагатай байх, эсвэл бусдад захирагдсан байдалтай байх зан төлөв үүсч төлөвшинө. 
          </p>
          <p className='details-p'>
          Захирагдсан байдал. Бусдад захирагдсан байдалтай байх нь өөрийгөө дорд үзэх, өөрийгөө голох, өөрийгөө буруутайд тооцох, хүлцэнгүй байх зэрэг бие хүний сөрөг шинж чанар үүсч төлөвших сэтгэл зүйн үндэс болно.
          </p>
          <h4>4.	Сургуулийн насны үе (6-12 нас)</h4>
         
          <p className='details-p'>
          Энэ шатыг Эриксон хүүхдийн хөдөлмөрлөх дур сонирхол төлөвших ба дутуу дулимагаа мэдрэх мэдрэмж хоёрын аль нэг нь төлөвших үе гэжээ. Энэ үед хүүхдүүд маш олон төрлийн чадвар дадал эзэмшдэг.  </p>
          <p className='details-p'>
            <b>Хөдөлмөрлөх дур сонирхол.</b> Хүүхдийн логик сэтгэлгээ, сахилга дэг журам, тодорхой дүрэм горимын хүрээнд үе тэнгийнхэнтэйгээ харилцах чадварууд сайжран хөгжих шат юм. Энэ насандаа бүх юманд сонирхолтой, судлан шинжилж, туршихдаа дуртай байдаг. Аль ч тохиолдолд хүүхэд өөрийн соёл иргэншлийн ёс зүйн технологийнг мэдрэх мэдрэмж нь сайжирч, юуг яаж хийх ёстойг ойлгож, уг ойлголттойгоо өөрийн байдлаа адилтган жишиж эхэлдэг байна. Энэ ч үүднээс хүүхэд хөдөлмөрт дурлах мэдрэмж бий болдог.
          </p>
          <p className='details-p'>
          <b> Дутуу дулимагийн зөрчил.</b> Энэ шатанд хүүхэд өөрийн болон үе тэнгийн хүүхдүүдийн бие бялдрыг илүү сайн мэддэг болно. Хэрвээ хүүхэд өөрийгөө бусдаас “өөр” болохыг мэдэрвэл бүрэг ичимхий нэгэн болж хувирдаг. Энэ үед нэг үйл ажиллагаанаас нөгөө рүү гэнэт шилжих нь тэдэнд бэрхшээлтэй байдаг. Энэ үеийн өөр нэг онцлог нь бэлгийн бойжилт эрчимтэй явагдах болсноор хүүхэд үе тэнгийнхэн рүүгээ бие сэтгэлээрээ татагдаж эхлэх ч нөгөө талаасаа үеийнхэн нь тоохгүй байхыг үгүйсгэхийн аргагүй юм. Хүүхдийн эрхэм чанарыг жинхэнэ мэдлэг чадвараар нь биш яс үндэс, эдийн засгийн байдлаар нь үнэлж байна гэдгийг хүүхдүүд олж мэдвэл, тэдэнд дутуу дулимагийн мэдрэмж бий болно. Өөрөөр хэлбэл, хүүхэд өөрийн чадвар боломж, үе тэнгийнхэн дотроо эзлэх байр сууриндаа эргэлзэж эхэлбэл өөрийгөө чамлан бусдаас дутуу дулимаг юм шиг мэдрэмж түүнд төрнө.
          </p>

          
          <h4>5.	Өсвөр насны үе (12-18 нас) - “Би”-гээ танин мэдэх үүрэг холилдох мэдрэмжийн зөрчлийн үе. </h4>
          
          <p className='details-p'>
          Өсвөр нас бол хүний амьдралын хоёр дахь шинэ үе шат юм. Залуус энэ үед хүүхэд насаа үдэж, нас бие гүйцэх бөгөөд тэдний хөгжлийн бүх хүрээнд гайхалтай олон өөрчлөлтүүд гардаг.
          </p>
          <p className='details-p'>
          “Би цогцолбор”. Энэ насны хүүхдийн зорилго нь хөгжлийнхөө энэ үеийг хүртэл өөрт нь бий болсон зүйлүүдийг нэгтгэн өөрийнхөө талаарх ойлголтыг зангидан “Би”-гийн талаарх цогц ойлголтыг бий болгодог ба үүнийг эго адилтгал гэнэ. Тэд өөрийн хэн болох, эцэг эх багш нараасаа юугаараа өөр болох, аль нь тохирч байгааг мэдэх гэж төрөл бүрийн “Би”-г туршиж үздэг. Сурагч, найз нөхөд, бүлэг, хамтлагийн гишүүн гэх мэт олон үүргүүдийг нэгэн зэрэг гүйцэтгэх ют байна гэдгээ мэдэрдэг.
          </p>
          <p className='details-p'>
          Бие хүний тодорхойгүй байдал. Өөрийгөө олоогүй, танин мэдээгүй будилан төөрөх. Өсвөр үеийнхэн, залуучууд өөрийгөө зөв таньж, гол гол үүргүүдээ хооронд нь уялдуулан нэгтгэн зангидаж чадахгүй дотоод зөрчилд орвол “Би” нь сарниж, түүний гүйцэтгэх ёстой олон үүргүүд хоорондоо холилдон зөрчилдөнө. Адилтгалыг шийдвэрлэж чадаагүй охид хөвгүүдэд бие хүний тодорхойгүй байдал үүсч төлөвшинө.
          </p>
          
          <h4>6.	Ид насны үе (18-35 нас) – дотносох ба зожигрохын зөрчлийн үе.  </h4>
          
          <p className='details-p'>
          Би өөрийгөө бусад хүнд бүрэн зориулж чадах уу гэсэн эгзэгтэй асуултанд хариулах үе учраас дотносох ба зожигрох мэдрэмжийн аль нэг нь хүнд төрдөг гэж Эриксоны онолд тодорхойлсон байдаг.
          </p>
          <p className='details-p'>
          Хамааралтай байх ба бие хүний байр сууриа олох. Гэр бүлийн амьдрал зохиоход хайр сэтгэлийн холбоо тогтоох, хань ижил, ажил мэргэжил, амьдран суурьших газар орноо сонгож өөрийгөө бэлтгэх буюу бие, сэтгэл, нийгмийн хувьд нас бие гүйцэх үе үргэлжилнэ. Мөн энэ үед нийгэмд өөрийгөө хүлээн зөвшөөрүүлэх, хувийн онцлогоо таниулж мэдрүүлэх, тодорхой бүлэгт харъяалагдах арга замыг мэдэрч, төлөвлөх болон шийдвэр гаргах үйл ажиллагаанд идэвхтэй оролцож нийгэмд эзлэх байр сууриа тогтоож эхэлнэ.
          </p>
          <p className='details-p'>
          Ганцаараа байх, зожигрох зөрчил. Өөрийн бодол санаандаа хэт  дарагдан өөрийгөө анхаарч бусадтай харилцахаас зайлсхийж эхэлвэл хөгжлийн энэ шатанд маш эрсдэлтэй гэж Эриксон үзжээ. Бусдаас хамааралгүй байх, өөрийгөө бусдад хүлээн зөвшөөрүүлэх, хувийн онцлогоо таниулж мэдрүүлэх, тодорхой бүлэгт харъяалагдах арга замыг мэдэрч, төлөвлөх болон шийдвэр гаргах үйл ажиллагаанд идэвхтэй оролцож нийгэмд эзлэх байр сууриа тогтоож эхэлнэ.
          </p>
          <p className='details-p'>
          Ганцаараа байх, зожигхрох зөрчил. Өөрийн бодол санаандаа хэт дарагдан өөрийгөө анхаарч бусадтай харилцахаас зайлсхийж эхэлвэл хөгжлийн энэ шатанд маш эрсдэлтэй гэж Эриксон үзжээ. Бусдаас хамааралгүй байх, өөрийгөө бусдад хүлээн зөвшөөрүүлэх гэсэн хүчтэй тэмүүлэл, өөрийн хийж байгаа зүйлээсээ учрах эрсдлийг ухаарч ойлгоогүй зэргээсээ болж эцэг эх, бусад хүмүүстэй үе үе зөрчилддөг. Өөртөө итгэлтэй дотно харилцааг бусадтай тогтоож чадахгүй бол хүн ганцаардан тасарч, зожиг болдог. ганцаардмал хүмүүс нь бусадтай ёс төдийн харилцах ба би үүнийг хийвэл буруудах юм юу ч байхгүй гэж итгэдэг тул тэд заримдаа маш эрсдэлтэй зүйлийг хийдэг.
          </p>
          
          <h4>7.	Дундаж насны үе (35-65 нас) – утга учир, үр бүтээлтэй амьдрал ба зогсонги байдлын зөрчлийн үе.</h4>
          
          <p className='details-p'>
          Энэ насны гол мөн чанар нь үр хүүхэд, хойч үеийнхээ төлөө санаа тавих, нийгэмд эерэг үр нөлөөтэй үйл ажиллагаа явуулах, хариуцлагатай байх явдал. Ингэж чадвал хөгжлийн эерэг тал нь “халамж”. Харин өөрийгөө сайн таньж чадаагүй, бусдад итгэдэггүй, зөвхөн хувиа бодон нийгмээс тасарсан хүмүүсийн амьдрал зогсонги байдалд ордог. Үүний улмаас ирээдүйдээ итгэх итгэл алдарч, архидан мансуурах эрсдэлтэй болохоос гадна дунд насны хямралд ордог. 
          </p>

          
          <h4>8.	Ахмад насны үе (65-аас дээш) – “Би”-ийн цогцолборын тодрол ба цөхрөх мэдрэмжийн зөрчлийн үе. </h4>
          
          <p className='details-p'>
          Хүмүүс ажил хэргийн төлөө анхаарал халамж тавьж, амьдралдаа алдаж онож явсан, үзэл бодлоо байнга илэрхийлж явсан зэрэг хүний өнгөрүүлсэн амьдралынх нь үр дүн аажмаар тодрон гарч ирдэг.
          </p>
          
          <p className='details-p'>
          Энэ насны хөгжлийн эерэг тал нь “гэгээрэл-саруул ухаан” юм. Харин зарим хүмүүс ололт амжилтын мэдрэмжгүй “би”-гээ цогцолбор байдлаар нь харж чаддаггүй. Үүний улмаас үхэхээс айх, ямар нэгэн муу юм тохиолдох вий гэдэг айдас өөрийн эрхгүй төрж, түгшүүрт автдаг байна (Өсвөр үеийнхэнд өгөх сэтгэл зүйн зөвлөгөө, 2014, 10-13х).
           </p>



          </AccordionDetails>
      </Accordion>


      <Accordion  sx={{ borderRadius: '12px' }}
        className={`accordion ${expanded === 'panel5' ? 'expanded' : ''}`} 
        expanded={expanded === 'panel5'} 
        onChange={handleChange('panel5')}
      >
        <AccordionSummary sx={{ borderRadius: '12px' }}
          expandIcon={<ExpandMoreIcon />}
          aria-controls="panel5-content"
          id="panel5-header"
          className="accordion-summary"
        >
          Ээнэгшлийн онол 
        </AccordionSummary>
        <AccordionDetails sx={{ borderRadius: '12px' }} className="accordion-details">
          
        <p className='details-p'>
        Ээнэгшин дасах онолыг хүүхдийн хөгжлийн асуудалтай холбон сэтгэл судлалыг судлах асуудлын хүрээнд өргөн тайлбарладаг хэдий ч Сканнапиоко ба түүний нөхдийн экологийн загвартай холбон тайлбарласнаар энд товч танилцуулъя.
        </p>
        <p className='details-p'>
        Хүүхэдтэй зүй бус харьцах явдлыг судлах судалгаа, практикт ээнэгшин дасах онолыг хэрэглэснээс хойш хорь гаруй жил болж байна (Scannapieco and Connel-Carrick, 2005). Хүүхэд хэн нэгэнд дасах үйл явц түүний төрсөн цагаас эхэлж, хүүхдийн амьдралын эхний гурван жилийн хугацаанд гол суурь нь тавигдана. 
       </p>
        <p className='details-p'>
        Нярай хүүхэд өөртэй нь байнга цуг байх асран хамгаалагчаас бүрэн хараат байдаг. Асран хамгаалагч энэ хараат байдалд хэрхэн хандах хандлагаас хамаарч тэдний хоорондын ээнэгшин дасах үйл явц өрнөнө. Бат бэх, эерэг, чанартай ээнэгшин дассан харилцаа холбоог үүсгэхийн тулд асран хамгаалагч нь нярай хүүхдийн хэрэгцээ, хүсэлтэд тасралтгүй, мэдрэмжтэй хандах хэрэгтэй. Ингэснээрээ асран хамгаалагч ба нярай хүүхэд хоёрын хооронд чанартай эерэг харилцаа холбоо бий болно. 
        </p>
        <p className='details-p'>
        Перригийн онцлон тэмдэглэснээр, ээнэгшин дасах харилцаа нь тодорхой нэг хүнтэй ойр дотно болох, аюулгүй байдлыг мэдрэх, тогтоосон харилцаа холбооноос таашаал, ая тухтай байдлыг олж мэдрэх, хямрал, дарамтаас гарч чадах тийм сэтгэл санааны хүчийг үүсгэх удаан үргэлжлэх харилцан хамааралтай холбоо юм. Ээнэгшин дасах харилцаа холбоог томъёолохдоо хоёр талтай, хариу үйлдэлд чиглэсэн гэж таамаглал дэвшүүлдэг. Энэ нь юу гэсэн үг вэ гэвэл асран хамгаалагч хүүхдийн хэрэгцээнд мэдрэмжтэй хандаж, юуг яаж хүсэж байгааг нь таньж мэдэн ялгаатай хариу үйлдэл үзүүлснээр хүүхдийн хүсэлт, хэрэгцээ хангагдаж эргэн тааламжтай байдлаа илэрхийлнэ. Энэ нь асран хамгаалагч нярай хүүхэд хоёрын харилцаа холбоог улам бэхжүүлнэ.
        </p>
        <p className='details-p'>
        Ээнэгшин дасах үйл явцад асран хамгаалагч ба нярай хүүхдийн хувийн онцлог орчин, тэдний хоорондын нийцэл чухал нөлөөтэй.
        </p>
        <p className='details-p'>
        Нярай хүүхэд, асран хамгаалагчийн хооронд үүссэн ээнэгшин дасах харилцаа холбоо нь дараах 4 хэлбэртэй. Үүнд:
        </p>
        
        <ul>
            <li>1. Хамгаалагдсан дасах харилцааг мэдэрч өссөн хүүхэд асран хамгаалагчаа түүнийг хамгаалах гол хүн гэж үзнэ.</li>
            <li>2.	Хамгаалалтгүй-зугатах шинжтэй харилцаа холбоонд дассан хүүхэд асран хамгаалагчаа байхад түүнээс зугатахыг оролдоно.</li>
            <li>3.	Хамгаалалтгүй, эсэргүүцсэн тодорхой биш харилцаа холбоонд дассан хүүхэд асран хамгаалагчтайгаа байнга хамт байхыг оролдох ба түүнийг байхад урьдчилсан нөхцөл бий болгон, түүнээс түр салахад сэтгэл санаа нь их хямардаг.</li>
            <li>4.	Хамгаалалтгүй-замбараагүй, зохион байгуулалтгүй харилцаа холбоонд дассан хүүхдээс сонин хачин зан авир гаргах, асран хамгаалагчаасаа айх, эсвэл түүнийг танихгүй байх гэсэн шинжүүд илэрнэ (Scannapieco and Connel-Carrick, 2005). </li>
          </ul>
          
        <p className='details-p'>
        Хүүхэдтэй зүй бус харьцах явдлыг хүүхдийн ээнэгшин дассан харилцаатай холбосон судалгаа олон байдаг. Тэдгээр судалгааны нэгнээс дурдвал, судалгаанд хамрагдсан хүчирхийлэл, дарамтанд өртсөн хүүхдүүдийн гуравны хоёр нь хамгаалалтгүй харилцаа холбоонд дассан хүүхдээс сонин хачин зан авир гаргах, асран хамгаалагчаасаа айх, эсвэл түүнийг танихгүй байх гэсэн шинжүүд илэрнэ (Scannapieco and Connel-Carrick, 2005).
         </p>

        <p className='details-p'>
        Сонирхолтой нь тэдний ээнэгшин дассан байдал нь харьцангуй тогтвортой нэг хэлбэртэй байв. Харин судалгаанд хамрагдсан хүчирхийлэл дарамтанд өртөөгүй хүүхдүүдийн гуравны хоёрт хамгаалалттай ээнэгшин дасах шинжүүд илэрчээ. Гэхдээ судлаачид хүүхдийн ээнэгшин дассан байдлыг судлахдаа түүний орчны соёлын хүчин зүйлсийн нөлөөг анхаарах хэрэгтэйг онцлон тэмдэглэсэн байдаг.
        </p>
        <p className='details-p'>
        Хүүхэдтэй зүй бус харьцах явдлын хохирогч болсон хүүхдүүдийн хувьд, ялангуяа үл хайхрах явдалд өртсөн хүүхдүүдийн ээнэгшин дасах харилцаа холбоог судалж үзэх нь их чухал. Хүүхдээ үл хайхардаг эцэг эхчүүдийн нийтлэг нэг шинж нь тэд орлогоосоо үл хамааран хүүхдүүддээ анхаарал халамж муу тавьдаг байна. Нөгөө талаас үл хайхрах явдлын шалтгааныг ядууралтай холбохгүйгээр эцэг эх ба хүүхдийн харилцаа холбоонд анхаарал хандуулан судалж болохыг Сканнапиеко тэмдэглэн хэлсэн байдаг. Үл хайхрах явдал нь эцэг эх-хүүхдийн таарамжгүй харилцаа, тэдний ээнэгшин дасах үйл явц сул хөгжсөнтэй холбоотой гэсэн дүгнэлтүүд ч байдаг (Scannapieco and Connel-Carrick, 2005). (Батхишиг, А., Мягмар, О., Нямдорж, М., 2009, 24-26х.)
        </p>
        <p className='details-p'>

        </p>
        <p className='details-p'>

        </p>


          </AccordionDetails>
      </Accordion>



      <Accordion  sx={{ borderRadius: '12px' }}
        className={`accordion ${expanded === 'panel6' ? 'expanded' : ''}`} 
        expanded={expanded === 'panel6'} 
        onChange={handleChange('panel6')}
      >
        <AccordionSummary sx={{ borderRadius: '12px' }}
          expandIcon={<ExpandMoreIcon />}
          aria-controls="panel6-content"
          id="panel6-header"
          className="accordion-summary"
        >
          Экологийн загвар
        </AccordionSummary>
        <AccordionDetails sx={{ borderRadius: '12px' }} className="accordion-details">
          
        <p className='details-p'>
        Гарбариногийн (1977) тайлбарласнаар, хүний орчны экологийг дөрвөн систем буюу тогтолцоонд хуваан үзэх бөгөөд систем бүрийн нөлөөлөх хүчин зүйлсийг дараах байдлаар дэлгэн харуулсан. Үүнд: 
        </p>

        <ul>
            <li>a.	Хувь хүний түвшинд тухайн хүний амьдарч буй орчиндоо хэрхэн дасч байгааг ойлгох нь нэг талаас хохирогч хүүхэд, нөгөө талаас хүчирхийлэл үйлдсэн хүний онцлог шинж чанартай холбон тайлбарлах боломжийг судлаачид олгоно. Энэ түвшний хүчин зүйлсийг “онтоген” хүчин зүйлс гэж мөн нэрлэдэг,</li>
            <li>b.	Микро түвшинд хүүхэдтэй шууд харьцах орчин, тухайлбал, гэр бүлтэйгээ хүүхэд ямар холбоотой байгааг ойлгохын тулд хүүхдэд хамгийн ойрхон нөлөөлж буй тогтолцоо, нийгмийн нэгж хэсгүүд нь түүний амьдралд хэрхэн нөлөөлж буйг судална,</li>
            <li>c.	Орчныг илүү өргөн хүрээнд харах боломжтой олон нийтийн хүрээ буюу экзо-системд хийсэн судалгаа нь хүүхдийн гэр бүлд орчны нөхцөл байдал, орон нутгийн хүмүүсийн амьдралын чанар хэрхэн нөлөөлж буйг танихад чиглэнэ,</li>
            <li>d.	Улс төр, эдийн засаг, соёл, хүн ам зүйн хүчин зүйлс бүхий макро системийн нөлөө хүүхэд ба түүний гэр бүлд хэрхэн тусаж буйг танихын тулд макро түвшний хүчин зүйлсийг судлах хэрэгтэй гэж тодорхойлсон (Belsky, 1993; Drake, Pandey, 1996; Freishtler, et al., 2006; Garbarino, 1977; Sidebotham, Heron, 2006). Хамгийн гол нь энэхүү системүүдийн хоорондын холбоог тайлбарласан экологийн хандлага нь хүүхдийн эсрэг хүчирхийлэл ба дарамтанд эдгээр систем нь хэрхэн нөлөөлөх тухай онолын судалгааг илүү өргөн хүрээнд харах боломжийг олгосон (Belsky, 1993; Freishtler, et al., 2006) бөгөөд хүүхдийн эсрэг хүчирхийлэлд нөлөөлж буй төрөл бүрийн хүчин зүйлсийг судлах бүх оролдлогуудаас хамгийн амжилттай оролдлого гэж хүлээн зөвшөөрөгдсөнөөрөө онцлог юм (Zigler, Hall, 1989).</li>
            
        </ul>

        <p className='details-p'>
        Онтогений ба микросистемийн хүчин зүйлс нь экологийн загвараар харьцангуй бага тайлбарлагдсан байдаг ч хүүхдийн эсрэг хүчирхийлэл ба дарамтанд нөлөөлөх эрсдлийн хүчин зүйлсийн тухай хэд хэдэн судалгаанд эдгээр хүчин зүйлсийн дараах байдлаар тодорхойлжээ. Үүнд эцэг эхийн нас, ялангуяа хэт залуу эцэг эх болох эцэг эхийн боловсрол нимгэн байдал, эцэг эхийн бага насандаа хүчирхийлэл, дарамтанд өртөж байсан түүх, хувийн зан чанар, сэтгэл зүйн онцлог, сэтгэцийн өвчин ба архи мансууруулах бодис хэрэглэж байсан түүх, сэтгэл санааны дарамт гутралд орсон зэрэг хүчин зүйлсийг эцэг эхтэй холбоотой болохыг тогтоосон байна (Belsky, 1993; Drake, Pandey, 1996; Sidebotham, Heron, 2006). Харин хүүхэдтэй холбоотой эрсдлийн хүчин зүйлст хүүхдийн нас, ялангуяа бага насны хүүхэд, хүүхдийн араншин, темперамент, зан үйлийн өөрчлөлт ба хөгжлийн бэрхшээл (Little, Kantor, 2002) зэргийг багтаажээ. Мөн хүүхдэд хамгийн ойр микро системийн хүчин зүйлс болох өрх толгойлсон эхтэй байх, хүчирхийлэлтэй гэр бүлд өсөх зэрэг нь хүүхэд хүчирхийлэл ба дарамтанд өртөх өндөр эрсдлийг дагуулдаг болохыг судлаачид мөн тогтоожээ (Fryer, 1993; Sidebotham, Heron, 2006).
        </p>

        <p className='details-p'>
        Харин экологийн загварыг ашиглан хүүхэдтэй зүй бус харьцах явдлыг судалсан судалгаанд экзо ба макро системийн хүчин зүйлсийг судалсан харьцангуй олон тооны судалгаа байдаг. Эдгээр судалгаа нь нийгэм эдийн засгийн хүчин зүйлсийг тухайлбал, ядуурал ба эдийн засгийн хараат байдал, эцэг эхийн ажилгүйдэл, өрх толгойлсон эцэг эсвэл эх хүүхдийн ганцаараа өсөх, нийгмээс тусгаарлагдсан байдал, хүүхдийн асрамж халамжийн үйлчилгээний газрын ачаалал хэт их, архи болон мансууруулах бодис элбэг, авах боломжтой байх зэрэг нь хүүхдийн эсрэг хүчирхийлэл ба дарамт үүсгэх орчны эрсдлийн хүчин зүйлс болдог тухай судлаачид тогтоожээ (Belsky, 1993; Berger, 2004; Coulton, Korbin, Su, Chow, 1995,  Drake, Pandey, 1996; Ernst, 2001; Freisthler, 2004; Garbarino, 1977; Sidebotham, Heron, 2006; and Slack, Holl, McDaniel, Yoo and Bolder, 2004).
        </p>

        <p className='details-p'>
        Харин экологийн загварыг ашиглан хүүхэдтэй зүй бус харьцах явдлыг судалсан судалгаанд экзо ба макро системийн хүчин зүйлсийг судалсан харьцангуй олон тооны судалгаа байдаг. Эдгээр судалгаа нь нийгэм эдийн засгийн хүчин зүйлсийг тухайлбал, ядуурал ба эдийн засгийн хараат байдал, эцэг эхийн ажилгүйдэл, өрх толгойлсон эцэг эсвэл эх хүүхдийн ганцаараа өсөх, нийгмээс тусгаарлагдсан байдал, хүүхдийн асрамж халамжийн үйлчилгээний газрын ачаалал хэт их, архи болон мансууруулах бодис элбэг, авах боломжтой байх зэрэг нь хүүхдийн эсрэг хүчирхийлэл ба дарамт үүсгэх орчны эрсдлийн хүчин зүйлс болдог тухай судлаачид тогтоожээ (Belsky, 1993; Berger, 2004; Coulton, Korbin, Su, Chow, 1995,  Drake, Pandey, 1996; Ernst, 2001; Freisthler, 2004; Garbarino, 1977; Sidebotham, Heron, 2006; and Slack, Holl, McDaniel, Yoo and Bolder, 2004).
        </p>
        <h3>Экологийн загвар</h3>

        <p className='details-p'>
        Энэ загвар нь эцэг эх болон хүүхдийн нийгэмтэйгээ ямар харилцан үйлчлэлд орж байгаагаас үүдэн хүчирхийлэл гардаг гэж үздэг. Экологийн онол нь амьд организмыг хүрээлэн буй орчинтойгоо ямар харилцан үйлчлэлд байгааг судалдаг экологийн шинжлэх ухааныг нийгэм, байгаль орчинтойгоо хүн ямар шүтэлцээтэй байгааг илрүүлэхэд ашиглахыг хэлнэ. Экологийн онолын загвараар хүний үйл ажиллагаа, хэрэгцээг үнэлэхдээ хүн ба түүний хүрээлэн байгаа орчны хооронд ямар холбоо, шүтэлцээ байна вэ гэдгийг анхаардаг.
        </p>
        
        <p className='details-p'>
        Энэ загвар нь Юри Брофенбреннерийн үндэслэсэн экологийн загвар дээр тулгуурладаг бөгөөд хүчирхийллийн түүхтэй гэр бүлийн дотор болон тойрон хүрээлж буй орчин нь эцэг эх, хүүхдийн хооронд зөрчил гаргахад нөлөөлөх магадлалтай (Belsky and Vondra, 1989) байдаг. Эдгээр нөлөөлөлд эцэг эхийн орох эсэх нь тэд өөрсдөө хүүхэд байхдаа  хүчирхийлэлд өртөж байсан эсэх, нийгэмд ноёрхож байгаа хүүхэд хүмүүжүүлэх соёл зан заншлаас ихэээхэн хамаардаг ажээ. Нийгмийн ажилтнууд орчны таагүй нөлөөллөөс өөрийгөө хамгаалах, тухайн бэрхшээлийг даван туулах хүний чадварыг дээшлүүлэх эсвэл орчны энэ сөрөг нөлөөг багасгах хоёр чиглэлээр үйлчилгээ үзүүлж болно. Ерөнхийдөө хүнд туслаж эерэг өөрчлөлт гаргахын тулд хүн ба түүний хүрээлэн буй орчинд нөлөөлөх ёстой гэж энэ онолыг баримтлагчид үздэг (Germain and Gitterman, 1996) (Энхтуяа, С., 2009, 32х).   
        </p>
          </AccordionDetails>
      </Accordion>


      <Accordion  sx={{ borderRadius: '12px' }}
        className={`accordion ${expanded === 'panel7' ? 'expanded' : ''}`} 
        expanded={expanded === 'panel7'} 
        onChange={handleChange('panel7')}
      >
        <AccordionSummary sx={{ borderRadius: '12px' }}
          expandIcon={<ExpandMoreIcon />}
          aria-controls="panel7-content"
          id="panel7-header"
          className="accordion-summary"
        >
          Хөгжлийн талаарх Л.С.Выготскийн үзэл баримтлал
        </AccordionSummary>
        <AccordionDetails sx={{ borderRadius: '12px' }} className="accordion-details">
          
        <p>
        1. Хүүхдийн хөгжил цаг хугацааны хувьд нарийн бүтэц зохион байгуулалттай байх зүй тогтол:
        </p>
        <ul>
            <li>Хүүхдийн сэтгэц нь цаг хугацааны ердийн хэмнэлттэй, үл тохирох өөрийн гэсэн хэмнэлттэй байдаг.</li>
            <li>Энэ хэмнэл нь янз бүрийн насанд өөрчлөгдөж байдаг бөгөөд нас насанд өөр өөр байна. Жишээ нь: Балчир насны үеийн сэтгэцийн хөгжлийн хэмнэл нь өсвөр насны үеийнхтэй тохирдоггүй.</li>
        </ul>
        
        <p>
        2.Хүүхдийн сэтгэцийн хөгжил дэх метаморфозын хууль:
        </p>
        <ul>
            <li>Хөгжил бол чанарын өөрчлөлтийн тасралтгүй гинжин холбоог илэрхийлж байдаг зүйл.</li>
            <li>Хүүхэд бол биднээс бага мэдлэг, чадвартай том хүний жижигрүүлсэн хувилбар биш. Түүний сэтгэц нь биднийхээс чанарын ялгаатай.</li>
        </ul>
        <p>
        3.Хүүхдийн сэтгэцийн хөгжил тэнцвэртэй биш явагдах зүй тогтол:
        </p>

        <ul>
            <li>Сэтгэцийн хөгжлийн бүх талууд нь тэнцвэртэй хөгждөггүй. Аль нэг тал нь эрчимтэй хөгжих үе гэж байдаг. </li>
            <li>Өөрөөр хэлбэл, нас бүрт сэтгэцийн аль нэг үйл бусдаасаа түлхүү хөгжих нөхцөл бүрдэнэ. Энэ зонхилон хөгжиж буй сэтгэцийн үйл нь бусаддаа зохих нөлөө үзүүлж, бусад нь дагалдах маягтай хөгжинө.</li>
        </ul>
        <p>
        4.Сэтгэцийн дээд үйл нь зан үйлийн хамтын хэлбэрээр илэрч зөвхөн үүний дараагаар хүүхдийн өөрийнх нь зан үйлийн хувийн хэлбэрт шилжинэ. Үүний дараалал:
        </p>
        <ul>
            <li>1. Эхлээд орчны хүмүүс нь хүүхдэд хандсан тодорхой үйлчилгээ, нөлөө үзүүлнэ. </li>
            <li>2. Дараагийн шатанд хүүхэд орчныхоо хүмүүстэй харилцан үйлчлэлцэж эхэлнэ.</li>
            <li>3. Үүний дараагаар хүүхэд бусдад хандан үйлчлэх чадвартай болно.</li>
            <li>4. Эцэст нь хүүхэд өөрөө өөртөө хандаж үйлчилж эхэлнэ. </li>
        </ul>
        
        <p className='details-p'>
        Жишээлбэл, хүүхдийн зориудын анхаарлын хөгжлийг аваад үзье. Том хүмүүс эхлээд хүүхдийн анхаарлыг төвлөрүүлэн өдөөгч нь юм. Дараа нь хүүхэд хэлд орж ярьж сурна. Уг өдөөгчийг эзэмшиж байна гэсэн үг. Цаашдаа өөрөө үгийн тусламжтайгаар насанд хүрэгчдийн анхаарлыг сонирхсон зүйл рүүгээ хандуулж эхэлнэ. Эцэст нь гаднаас харахад ямар ч тулгуур хэрэгсэлгүйгээр анхаарлаа зориуд дотроо төвлөрүүлэх чадвартай болно.
        </p>

        <p className='details-p'>
        Сэтгэцийн энгийн доод үйлүүдээс дээд үйлүүдийн ялгагдах онцлог:
       </p>

        <p className='details-p'>
        Ухамсарлагдсан, дам, зориудын шинж чанартай.
       </p>

        <p className='details-p'>
        Нийгмийн түүхэн хөгжлийн бүтээсэн тэмдэг, тэмдгийн систем, багаж зэвсгийг эзэмших явцад бий болно.
       </p>

        <p className='details-p'>
        Нийгмийн амьдралд сургах, сургалтын явцад хөгжин төлөвшинө.
        </p>

        <p className='details-p'>
        Ийм учраас Л.С.Выготский сэтгэцийн хөгжлийн хөдөлгөгч хүч нь сургалт юм гэж үзжээ (Мягмар, О., 1999, 4-5х). 
        </p>





          </AccordionDetails>
      </Accordion>

    </div>
    </div>
  );
}
